Repository: eduMFA/authenticator
Catalog: lib/l10n/intl_*.arb
Languages: cs, fr

source: Accept
cs: Přijmout
fr: Accepter

source: Decline
cs: Odmítnout
fr: Refuser

source: Name
cs: Název
fr: Nom

source: Secret key
cs: Tajný klíč
fr: Clé secrète

source: Rename
fr: Renommer

source: Cancel
cs: Zrušit
fr: Annuler

source: Delete
cs: Smazat
fr: Supprimer

source: Dismiss
cs: Zavřít
fr: Fermer

source: Add token
cs: Přidat token
fr: Ajouter un jeton

source: Scan QR-Code
fr: Numériser QR-Code

source: Rename token
fr: Renommer jeton

source: Confirm deletion
cs: Potvrdit smazání
fr: Confirmer suppression

# confirmDeletionOf
source: Are you sure you want to delete {name}?
cs: Opravdu chcete smazat token {name}?
fr: Confirmer la suppression de {name}?

# confirmTokenDeletionHint
source: You may no longer be able to log in if you delete this token. Please make sure that you can log in to the associated account without this token.
cs: Pokud tento token odstraníte, nebude již možné se přihlásit. Prosím, ujistěte se, že se můžete přihlásit k přidruženému účtu bez tohoto tokenu.
fr: Il se peut que vous ne puissiez plus vous connecter si vous supprimez ce token. Veuillez vous assurer que vous pouvez vous connecter au compte associé sans ce token.

source: Generating phone part
cs: Generování klientské části
fr: Générer la part du téléphone

source: Phone part:
cs: Klientská část:
fr: Part du téléphone:

source: Settings
cs: Nastavení
fr: Paramètres

source: Push Token
cs: Push notifikace
fr: Jeton de type Push

source: Theme
cs: Vzhled
fr: Thème

# lightTheme
source: Light
cs: Světlý
fr: Thème lumineux

# darkTheme
source: Dark
cs: Tmavý
fr: Thème sombre

# systemTheme
source: Use device's theme
fr: Utiliser le thème de l'appareil

source: Enable polling
cs: Povolit polling
fr: Activer l'interrogation du serveur.

# requestPushChallengesPeriodically
source: Request push challenges from the server periodically. Enable this if push challenges are not received normally.
cs: Periodicky získávat výzvy ze serveru. Povolte pokud nefunguje příjem push notifikací.
fr: Demander des challenges push depuis le serveur périodiquement. Activer cette fonction si les challenges push ne sont pas reçus normalement.

source: Synchronize push tokens
cs: Synchronizace push tokenů
fr: Synchoniser les jetons Push

# synchronizesTokensWithServer
source: Synchronizes tokens with the eduMFA server.
cs: Synchronizovat tokeny se serverem eduMFA.
fr: Synchroniser les jetons Push avec le serveur eduMFA.

source: Sync
cs: Synchronizovat
fr: Synchroniser

source: Synchronizing tokens.
cs: Tokeny se synchronizují.
fr: Synchroniser les jetons.

# allTokensSynchronized
source: All tokens are synchronized.
cs: Všechny tokeny jsou synchronizované.
fr: Tous les jetons ont été synchronisés.

# synchronizationFailed
source: Synchronization failed for the following tokens, please try again:
cs: Synchronizace následujících tokenů selhala, zkuste to znovu:
fr: La synchronisation a échoué pour ces jetons, veuillez reéssayer:

# tokensDoNotSupportSynchronization
source: The following tokens do not support synchronization and must be rolled out again:
cs: Následující tokeny nepodporují synchronizaci a musí být znovu zaregistrovány:
fr: Ces jetons ne supportent pas la synchronisation et doivent être de nouveau générés:

# errorRollOutFailed
source: Rolling out token {name} failed.
cs: Registrace tokenu {name} selhala.
fr: Le déploiement du jeton {name} a échoué.

# statusCode
source: Status code: {statusCode}
cs: Stavový kód: {statusCode}
fr: Code d'état : {statusCode}

# errorSynchronizationNoNetworkConnection
source: Synchronizing tokens failed, eduMFA server could not be reached.
cs: Synchronizace tokenů selhala, připojení k serveru eduMFA se nezdařilo.
fr: La synchronization a échoué car le serveur est injoignable.

# errorRollOutUnknownError
source: An unknown error occurred. Roll-out not possible: {e}
cs: Vyskytla se neznámá chyba. Registrace není možná: {e}
fr: Le déploiement a échoué suite à une erreur inconnue: {e}

source: Rolling out
cs: Registrace
fr: Déploiement en cours

# unexpectedError
source: An unexpected error occurred.
cs: Nastala neočekávaná chyba.
fr: Une erreur inattendue s'est produite.

source: Polling failed.
cs: Dotaz se nezdařil.
fr: Échec de la requête.

# pollingFailedFor
source: Polling failed for {serial}
cs: Dotaz na {serial} se nezdařil.
fr: Echec de la requête pour {serial}.

source: No network connection.
cs: Žádné připojení k síti.
fr: Pas de connexion au réseau.

source: Connection failed.
cs: Připojení se nezdařilo.
fr: La connexion a échoué.

# checkYourNetwork
source: Please check your network connection and try again.
cs: Zkontrolujte prosím síťové připojení a zkuste to znovu.
fr: Veuillez vérifier votre connexion réseau et réessayer.

source: Could not sign message.
cs: Zprávu se nepodařilo podepsat.
fr: Impossible de signer le message.

# authenticateToShowOtp
source: Please authenticate to show one time password.
fr: Veuillez vous authentifier pour afficher un mot de passe à usage unique.

# authenticateToUnLockToken
source: Please authenticate to change the lock status of the token.
fr: Veuillez vous authentifier pour modifier l'état de verrouillage du jeton.

# biometricRequiredTitle
source: Biometrics not setup
cs: Biometrické ověření není nastaveno
fr: La biométrie n'est pas configurée

# biometricHint
source: Authentication required
cs: Vyžadováno přihlášení
fr: Authentification requise

# biometricNotRecognized
source: Not recognized. Try again.
cs: Ověření se nezdařilo. Zkuste to znovu.
fr: Pas reconnu. Réessayer.

# biometricSuccess
source: Authentication successful
cs: Přihlášení bylo úspěšné
fr: Authentification réussie

# deviceCredentialsRequiredTitle
source: Device credentials not set up
cs: Není nastaven zámek zařízení
fr: Les informations d'identification de l'appareil ne sont pas configurées

# deviceCredentialsSetupDescription
source: Setup device credentials in the device's settings
cs: Nastave zámek zařízení v nastavení zařízení
fr: Configurer les informations d'identification de l'appareil dans les paramètres de l'appareil

# signInTitle
source: Authentication required
cs: Vyžadováno přihlášení
fr: Authentification requise

# goToSettingsButton
source: Go to settings
cs: Otevřít nastavení
fr: Aller aux paramètres

# goToSettingsDescription
source: Authentication by credentials or biometrics is not set up on your device. Please set it up in the device's settings.
cs: Není nastaveno přihlášení zámkem zařízení ani biometrické ověření. Aktivujte je v nastavení zařízení.
fr: L'authentification par identifiants ou biométrie n'est pas configurée sur votre appareil. Veuillez le configurer dans les paramètres de l'appareil.

# lockOut
source: Biometric authentication is disabled. Please lock and unlock your screen to enable it.
cs: Biometrické ověření je deaktivováno. Pro aktivaci zamkněte a znovu odemkněte obrazovku/zařízení.
fr: L'authentification biométrique est désactivée. Veuillez verrouiller et déverrouiller votre écran pour l'activer.

# authNotSupportedTitle
source: Device credentials or biometrics required
cs: Vyžadován zámek zařízení nebo biometrické ověření
fr: Informations d'identification de l'appareil ou données biométriques requises

# authNotSupportedBody
source: This action requires the device to be secured by credentials or biometrics.
cs: Tato akce vyžaduje, aby bylo zařízení chráněno zámkem zařízení nebo biometrickým ověřením.
fr: Cette action nécessite que l'appareil soit sécurisé par des identifiants ou des données biométriques.

source: Lock
cs: Zamknout
fr: Bloquer

source: Unlock
fr: Ouvrir

# noResultTitle
source: No tokens stored yet.
cs: Nejsou nainstalovány žádné tokeny.
fr: Aucun jeton n'est encore stocké.

# noResultText1
source: Tap the
cs: stiskněte tlačítko
fr: Appuyez sur le

# noResultText2
source: button to get started!
cs: a začněte s používáním.
fr: bouton pour commencer!

# onBoardingText1
source: Two-factor authentication made easy
cs: vícefázové ověření usnadněno
fr: Authentification à deux facteurs rendue facile

# onBoardingTitle2
source: Maximum Security
cs: Maximální Bezpečnost
fr: Sécurité Maximale

# onBoardingText2
source: Store tokens on your device securely Protected by your biometrics
cs: Uložte tokeny do svého zařízení chráněné biometrickým ověřením
fr: Stockez les jetons sur votre appareil en toute sécurité Protégé par votre biométrie

# onBoardingTitle3
source: Visit us at Github
cs: Navštivte náš profil Github
fr: Rendez-nous visite sur Github

# onBoardingText3
source: This app is open source
cs: Tuto aplikaci má open source
fr: Cette application est open source

# errorLogTitle
source: Error log
fr: Journal d'erreur

source: Log menu
fr: Menu du journal

# showErrorLog
source: Show
fr: Afficher

# clearErrorLog
source: Clear
fr: Effacer

source: Send
cs: Odeslat
fr: Envoyer

# sendErrorLogDescription
source: A predefined email is created. It contains information about the app, the error and the device. You can edit the email before sending it. You can see here how we use the information:
cs: Vytvoří se připravený e-mail. Obsahuje informace o aplikaci, chybě a zařízení. Před odesláním můžete e-mail upravit. Zde se můžete podívat, jak informace používáme:
fr: Un e-mail pré-rempli est créé. Il contient des informations sur l'application, l'erreur et le périphérique. Vous pouvez modifier l'e-mail avant de l'envoyer. Vous pouvez voir ici comment nous utilisons les informations:

source: Show privacy policy
cs: Zobrazit zásady ochrany osobních údajů
fr: Afficher la déclaration de confidentialité

# errorLogEmpty
source: The error log is empty.
cs: Protokol chyb je prázdný.
fr: Le journal des erreurs est vide

source: Verbose logging
fr: Journalisation verbeuse

source: Error log cleared.
cs: Protokol chyb vymazán.
fr: Journal d'erreur nettoyé

# errorMailBody
source: The error log file is attached. You can replace this text with additional information about the error.
cs: Přiložen je soubor protokolu o chybách. Tento text můžete nahradit dalšími informacemi o chybě.
fr: Le fichier journal des erreurs est joint. Vous pouvez remplacer ce texte par des informations supplémentaires sur l'erreur.

source: Show details
cs: Zobrazit podrobnosti
fr: Afficher les détails

source: Open
fr: Ouvrir

# deleteLockedToken
source: Please authenticate to delete the locked token.
cs: Prosím, autentifikujte se pro smazání uzamčeného tokenu.
fr: Veuillez vous authentifier pour supprimer le jeton verrouillé.

# editLockedToken
source: Please authenticate to edit the locked token.
cs: Prosím, autentifikujte se pro úpravu uzamčeného tokenu.
fr: Veuillez vous authentifier pour modifier le jeton verrouillé.

source: Retry rollout
cs: Zkusit znovu
fr: Réessayer le déploiement

source: Generating RSA key pair
cs: Generování párů klíčů RSA
fr: Génération de la paire de clés RSA

source: Generating RSA key pair failed
cs: Generování páru klíčů RSA se nezdařilo
fr: La génération de la paire de clés RSA a échoué

# sendingRSAPublicKey
source: Sending public RSA key
cs: Odeslání veřejného klíče RSA
fr: Envoi de la clé publique RSA

# sendingRSAPublicKeyFailed
source: Sending public RSA key failed
cs: Nepodařilo se odeslat veřejný klíč RSA
fr: L'envoi de la clé publique RSA a échoué

source: Parsing response
cs: Rozbor odpovědi
fr: Analyse de la réponse

source: Parsing response failed
cs: Parsování odpovědi se nezdařilo
fr: L'analyse de la réponse a échoué

source: Rollout completed
cs: Zavedení dokončeno
fr: Déploiement terminé

# errorRollOutNoConnectionToServer
source: Rolling out token {name} failed, the server could not be reached.
cs: Registrace tokenu {name} selhala. Server není dostupný.
fr: El despliegue del token {name} ha fallado, no se ha podido acceder al servidor.

# authToAcceptPushRequest
source: Please authenticate to accept the push request.
cs: Pro přijetí požadavku na push notifikaci se přihlaste.
fr: Veuillez vous authentifier pour accepter la demande de connexion.

# authToDeclinePushRequest
source: Please authenticate to decline the push request.
cs: Pro odmítnutí požadavku na push notifikaci se přihlaste.
fr: Veuillez vous authentifier pour refuser la demande de connexion.

# pushRequestParseError
source: Push request could not be parsed.
cs: Požadavek na odeslání se nepodařilo zpracovat.
fr: La demande push n'a pas pu être traitée.

# errorRollOutSSLHandshakeFailed
source: SSL handshake failed. Roll-out not possible.
cs: SSL handshake se nezdařil. Roll-out není možný.
fr: Échec de la prise de contact SSL. Le déploiement n'est pas possible.

# errorWhenPullingChallenges
source: An error occured when polling for challenges of {name}
cs: Při dotazování na výzvy {name} došlo k chybě.
fr: Une erreur s'est produite lors de l'interrogation des défis de {name}

# errorRollOutNotPossibleAnymore
source: Rolling out this Token is not possible anymore.
cs: Roll-out tohoto tokenu již není možný.
fr: Le déploiement de ce jeton n'est plus possible.

# errorTokenExpired
source: The token {name} has expired.
cs: Platnost tokenu {name} vypršela.
fr: Le jeton {name} a expiré.

source: Yes
fr: Oui

source: No
fr: Non

source: but discard it
fr: mais l'écarter

source: decline it
fr: refuser

# requestTriggerdByUserQuestion
source: Was this request triggered by you?
fr: Cette demande a-t-elle été déclenchée par vous ?

# grantCameraPermissionDialogTitle
source: Camera permission is not granted
fr: L'autorisation de la caméra n'est pas accordée

# grantCameraPermissionDialogContent
source: Please grant camera permission to scan QR codes.
fr: Veuillez accorder à la caméra l'autorisation de scanner les codes QR

# grantCameraPermissionDialogPermanentlyDenied
source: Camera permission is permanently denied. Please grant camera permission in your Phone's settings.
fr: L'autorisation de l'appareil photo est refusée de manière permanente. Veuillez accorder l'autorisation à l'appareil photo dans les paramètres de votre téléphone.

# grantCameraPermissionDialogButton
source: Grant permission
fr: Accorder l'autorisation

# decryptErrorTitle
source: Decryption error
cs: Chyba dešifrování
fr: Erreur de décryptage

# decryptErrorContent
source: Unfortunately, the app was unable to decrypt your tokens. This indicates that the encryption key is broken. You can try again or delete the app data, which would delete the tokens in the app.
cs: Bohužel se aplikaci nepodařilo dešifrovat vaše tokeny. To znamená, že šifrovací klíč je poškozen. Můžete to zkusit znovu nebo odstranit data aplikace, čímž by došlo k odstranění tokenů v aplikaci.
fr: Malheureusement, l'application n'a pas pu décrypter vos jetons. Cela indique que la clé de cryptage est cassée. Vous pouvez réessayer ou supprimer les données de l'application, ce qui supprimera les jetons dans l'application.

# decryptErrorButtonDelete
source: Delete
cs: Odstranit
fr: Supprimer

# decryptErrorButtonSendError
source: Send error
cs: Odeslat chybu
fr: Erreur d'envoi

# decryptErrorButtonRetry
source: Retry
cs: Opakování
fr: Réessayer

# decryptErrorDeleteConfirmationContent
source: Are you sure you want to delete the app data?
cs: Jste si jisti, že chcete data aplikace odstranit?
fr: Êtes-vous sûr de vouloir supprimer les données de l'application ?

# settingsGroupGeneral
source: General
cs: Obecné informace
fr: Généralités

source: Licenses and version
cs: Licence a verze
fr: Licences et version

source: Privacy policy
cs: Zásady ochrany osobních údajů
fr: Politique de confidentialité

# introEditToken
source: Here you can edit the token name and see some details.
fr: Ici, vous pouvez modifier le nom du token et voir quelques détails

# introLockToken
source: To improve security even more, you can lock tokens. Then the token can only be used after authentication.
fr: Pour améliorer encore la sécurité, vous pouvez verrouiller les tokens. Le token ne peut alors être utilisé qu'après l'authentification.

# introPollForChallenges
source: You can check for new challenges by dragging down the token list.
fr: Vous pouvez vérifier la présence de nouveaux défis en faisant glisser la liste des jetons vers le bas

source: Feedback
fr: Retour d'information

# feedbackTitle
source: Your feedback is always welcome!
fr: Vos commentaires sont toujours les bienvenus !

# feedbackDescription
source: If you have any questions, suggestions or problems, please let us know.
fr: Si vous avez des questions, des suggestions ou des problèmes, n'hésitez pas à nous en faire part

# feedbackHint
source: A ready-made e-mail will open, which you can send to us. If desired, information about your device and the version of the application will be added. You can check and edit the email before sending it.
fr: Un e-mail prêt à l'emploi s'ouvre, que vous pouvez nous envoyer. Si vous le souhaitez, des informations sur votre appareil et la version de l'application seront ajoutées. Vous pouvez vérifier et modifier l'e-mail avant de l'envoyer.

# feedbackPrivacyPolicy1
source: By sending the feedback you agree to our
fr: En envoyant le retour d'information, vous acceptez notre

# feedbackPrivacyPolicy2
source: privacy policy
fr: politique de confidentialité

# addSystemInfo
source: Add system information
fr: Ajouter des informations sur le système

# feedbackSentTitle
source: Feedback sent
fr: Retour d'information envoyé

# feedbackSentDescription
source: Thank you very much for your help in making this application better!
fr: Merci beaucoup pour votre aide dans l'amélioration de cette application !

# noMailAppTitle
source: No mail app found
cs: Není nainstalována žádná e-mailová aplikace
fr: Aucune application de messagerie trouvée

# noMailAppDescription
source: There is no e-mail app installed or initialised on this device, please try again when you are able to send an email message.
fr: Aucune application de messagerie n'est installée ou initialisée sur cet appareil. Veuillez réessayer lorsque vous serez en mesure d'envoyer un message électronique.

source: Authentication request
cs: Žádost o ověření
fr: Authentification

# requestInfo
source: Sent by {issuer} for your account: "{account}"
cs: Odesláno {issuer} pro váš účet: "{account}"
fr: Envoyé par {issuer} pour votre compte : "{account}"

source: Language
cs: Jazyk
